# Ex. 33 - SAT Scores, revisited

In [13]:
import pandas as pd
import numpy as np

In [47]:
cols = ['Year', 'State.Code', 'Total.Math', 'Family Income.Less than 20k.Math',
'Family Income.Between 20-40k.Math', 'Family Income.Between 40-60k.Math',
'Family Income.Between 60-80k.Math', 'Family Income.Between 80-100k.Math',
'Family Income.More than 100k.Math']
cols

['Year',
 'State.Code',
 'Total.Math',
 'Family Income.Less than 20k.Math',
 'Family Income.Between 20-40k.Math',
 'Family Income.Between 40-60k.Math',
 'Family Income.Between 60-80k.Math',
 'Family Income.Between 80-100k.Math',
 'Family Income.More than 100k.Math']

In [48]:
name_dict = {'Family Income.Less than 20k.Math': 'income<20k',
            'Family Income.Between 20-40k.Math': '20k<income<40k', 
             'Family Income.Between 40-60k.Math': '40k<income<60k',
            'Family Income.Between 60-80k.Math':'60k<income<80k', 
             'Family Income.Between 80-100k.Math':'80k<income<100k',
            'Family Income.More than 100k.Math':'income>100k'}
name_dict

{'Family Income.Less than 20k.Math': 'income<20k',
 'Family Income.Between 20-40k.Math': '20k<income<40k',
 'Family Income.Between 40-60k.Math': '40k<income<60k',
 'Family Income.Between 60-80k.Math': '60k<income<80k',
 'Family Income.Between 80-100k.Math': '80k<income<100k',
 'Family Income.More than 100k.Math': 'income>100k'}

In [51]:
df = pd.read_csv('../data/sat-scores.csv', header=0, usecols=cols)

In [53]:
df2 = pd.read_csv('../data/sat-scores.csv', header=0)
print(df2.shape)
df2.columns

(577, 99)

Index(['Year', 'State.Code', 'State.Name', 'Total.Math', 'Total.Test-takers',
       'Total.Verbal', 'Academic Subjects.Arts/Music.Average GPA',
       'Academic Subjects.Arts/Music.Average Years',
       'Academic Subjects.English.Average GPA',
       'Academic Subjects.English.Average Years',
       'Academic Subjects.Foreign Languages.Average GPA',
       'Academic Subjects.Foreign Languages.Average Years',
       'Academic Subjects.Mathematics.Average GPA',
       'Academic Subjects.Mathematics.Average Years',
       'Academic Subjects.Natural Sciences.Average GPA',
       'Academic Subjects.Natural Sciences.Average Years',
       'Academic Subjects.Social Sciences/History.Average GPA',
       'Academic Subjects.Social Sciences/History.Average Years',
       'Family Income.Between 20-40k.Math',
       'Family Income.Between 20-40k.Test-takers',
       'Family Income.Between 20-40k.Verbal',
       'Family Income.Between 40-60k.Math',
       'Family Income.Between 40-60k.Test-takers',
       'Family Income.Between 40-60k.Verbal',
       'Family Income.Between 60-80k.Math',
       'Family Income.Between 60-80k.Test-takers',
       'Family Income.Between 60-80k.Verbal',
       'Family Income.Between 80-100k.Math',
       'Family Income.Between 80-100k.Test-takers',
       'Family Income.Between 80-100k.Verbal',
       'Family Income.Less than 20k.Math',
       'Family Income.Less than 20k.Test-takers',
       'Family Income.Less than 20k.Verbal',
       'Family Income.More than 100k.Math',
       'Family Income.More than 100k.Test-takers',
       'Family Income.More than 100k.Verbal', 'GPA.A minus.Math',
       'GPA.A minus.Test-takers', 'GPA.A minus.Verbal', 'GPA.A plus.Math',
       'GPA.A plus.Test-takers', 'GPA.A plus.Verbal', 'GPA.A.Math',
       'GPA.A.Test-takers', 'GPA.A.Verbal', 'GPA.B.Math', 'GPA.B.Test-takers',
       'GPA.B.Verbal', 'GPA.C.Math', 'GPA.C.Test-takers', 'GPA.C.Verbal',
       'GPA.D or lower.Math', 'GPA.D or lower.Test-takers',
       'GPA.D or lower.Verbal', 'GPA.No response.Math',
       'GPA.No response.Test-takers', 'GPA.No response.Verbal',
       'Gender.Female.Math', 'Gender.Female.Test-takers',
       'Gender.Female.Verbal', 'Gender.Male.Math', 'Gender.Male.Test-takers',
       'Gender.Male.Verbal', 'Score Ranges.Between 200 to 300.Math.Females',
       'Score Ranges.Between 200 to 300.Math.Males',
       'Score Ranges.Between 200 to 300.Math.Total',
       'Score Ranges.Between 200 to 300.Verbal.Females',
       'Score Ranges.Between 200 to 300.Verbal.Males',
       'Score Ranges.Between 200 to 300.Verbal.Total',
       'Score Ranges.Between 300 to 400.Math.Females',
       'Score Ranges.Between 300 to 400.Math.Males',
       'Score Ranges.Between 300 to 400.Math.Total',
       'Score Ranges.Between 300 to 400.Verbal.Females',
       'Score Ranges.Between 300 to 400.Verbal.Males',
       'Score Ranges.Between 300 to 400.Verbal.Total',
       'Score Ranges.Between 400 to 500.Math.Females',
       'Score Ranges.Between 400 to 500.Math.Males',
       'Score Ranges.Between 400 to 500.Math.Total',
       'Score Ranges.Between 400 to 500.Verbal.Females',
       'Score Ranges.Between 400 to 500.Verbal.Males',
       'Score Ranges.Between 400 to 500.Verbal.Total',
       'Score Ranges.Between 500 to 600.Math.Females',
       'Score Ranges.Between 500 to 600.Math.Males',
       'Score Ranges.Between 500 to 600.Math.Total',
       'Score Ranges.Between 500 to 600.Verbal.Females',
       'Score Ranges.Between 500 to 600.Verbal.Males',
       'Score Ranges.Between 500 to 600.Verbal.Total',
       'Score Ranges.Between 600 to 700.Math.Females',
       'Score Ranges.Between 600 to 700.Math.Males',
       'Score Ranges.Between 600 to 700.Math.Total',
       'Score Ranges.Between 600 to 700.Verbal.Females',
       'Score Ranges.Between 600 to 700.Verbal.Males',
       'Score Ranges.Between 600 to 700.Verbal.Total',
       'Score Ranges.Between 700 to 800.Math.Females',
       'Score Ranges.Between 700 to 800.Math.Males',
       'Score Ranges.Between 700 to 800.Math.Total',
       'Score Ranges.Between 700 to 800.Verbal.Females',
       'Score Ranges.Between 700 to 800.Verbal.Males',
       'Score Ranges.Between 700 to 800.Verbal.Total'],
      dtype='object')

In [17]:
df = df.rename(columns=name_dict)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 577 entries, 0 to 576
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Year             577 non-null    int64
 1   State.Code       577 non-null    object
 2   Total.Math       577 non-null    int64
 3   20k<income<40k   577 non-null    int64
 4   40k<income<60k   577 non-null    int64
 5   60k<income<80k   577 non-null    int64
 6   80k<income<100k  577 non-null    int64
 7   income<20k       577 non-null    int64
 8   income>100k      577 non-null    int64
dtypes: int64(8), object(1)
memory usage: 40.7+ KB

In [19]:
df.head()

,Year,State.Code,Total.Math,20k<income<40k,40k<income<60k,60k<income<80k,80k<income<100k,income<20k,income>100k
0,2005,AL,559,513,539,550,566,462,588
1,2005,AK,519,492,517,513,528,464,541
2,2005,AZ,530,498,520,524,534,485,554
3,2005,AR,552,513,543,553,570,489,572
4,2005,CA,522,477,506,521,535,451,566

Find the average SAT math score for each income level, grouped and then
sorted by year.

In [20]:
df.select_dtypes(include=np.number)

,Year,Total.Math,20k<income<40k,40k<income<60k,60k<income<80k,80k<income<100k,income<20k,income>100k
0,2005,559,513,539,550,566,462,588
1,2005,519,492,517,513,528,464,541
2,2005,530,498,520,524,534,485,554
3,2005,552,513,543,553,570,489,572
4,2005,522,477,506,521,535,451,566
...,...,...,...,...,...,...,...,...
572,2015,517,469,488,496,514,441,549
573,2015,511,483,503,521,534,449,560
574,2015,500,468,483,487,503,448,522
575,2015,606,551,596,590,605,573,615
576,2015,587,533,550,561,598,0,573

In [21]:
df.select_dtypes(include=np.number).mean()

Year               2010.019064
Total.Math          535.682842
20k<income<40k      500.239168
40k<income<60k      522.844021
60k<income<80k      533.611785
80k<income<100k     547.055459
income<20k          461.734835
income>100k         565.830156
dtype: float64

In [22]:
df.groupby('Year').mean(numeric_only=True).sort_index()

,Total.Math,20k<income<40k,40k<income<60k,60k<income<80k,80k<income<100k,income<20k,income>100k
Year,,,,,,,
2005,535.653846,488.653846,522.673077,536.076923,548.942308,427.596154,572.173077
2006,537.480769,502.923077,523.769231,534.903846,550.461538,461.019231,572.519231
2007,535.339623,494.849057,519.490566,533.188679,545.698113,457.924528,565.169811
2008,535.981132,523.622642,547.471698,549.188679,557.641509,478.641509,564.566038
2009,540.803922,527.823529,550.980392,553.941176,565.333333,482.058824,585.784314
2010,540.843137,499.274510,522.000000,534.235294,547.627451,477.039216,569.274510
2011,533.226415,494.886792,513.415094,528.660377,541.849057,460.452830,563.245283
2012,533.603774,492.056604,512.452830,525.773585,538.301887,458.773585,557.320755
2013,532.622642,490.132075,511.377358,520.320755,537.396226,469.358491,556.339623
2014,534.283019,497.641509,514.943396,527.169811,543.132075,459.415094,555.433962
2015,533.094340,491.603774,513.754717,527.132075,542.037736,447.490566,563.433962

In [23]:
(
    df
    .groupby('Year')
    [['income<20k',
      '20k<income<40k',
      '40k<income<60k',
      '60k<income<80k',
      '80k<income<100k',
      'income>100k']]
    .mean()
    .T
    .pct_change()
)

Year,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
income<20k,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20k<income<40k,0.142793,0.090894,0.080635,0.093977,0.094936,0.046611,0.074783,0.072548,0.044260,0.083207,0.098579
40k<income<60k,0.069618,0.041450,0.049796,0.045546,0.043872,0.045517,0.037439,0.041451,0.043346,0.034768,0.045059
60k<income<80k,0.025645,0.021259,0.026368,0.003136,0.005374,0.023439,0.029694,0.025994,0.017489,0.023743,0.026038
80k<income<100k,0.023999,0.029085,0.023462,0.015391,0.020566,0.025068,0.024947,0.023828,0.032817,0.030279,0.028277
income>100k,0.042319,0.040071,0.035682,0.012418,0.036175,0.039529,0.039487,0.035331,0.035250,0.022650,0.039474

In [24]:
(
    df
    .groupby('Year')
        [['income<20k',
        '20k<income<40k',
        '40k<income<60k',
        '60k<income<80k',
        '80k<income<100k',
        'income>100k']]
    .mean()
    .T
    .pct_change()
    .T
    .mean()
)

income<20k              NaN
20k<income<40k     0.083929
40k<income<60k     0.045260
60k<income<80k     0.020744
80k<income<100k    0.025247
income>100k        0.034399
dtype: float64

In [25]:
df.mean(axis='columns', numeric_only=True)

0      722.750
1      697.375
2      706.250
3      724.625
4      697.875
        ...
572    686.125
573    697.000
574    678.250
575    768.875
576    677.125
Length: 577, dtype: float64

In [26]:
change = (
df
.groupby('Year')
[['income<20k',
'20k<income<40k',
'40k<income<60k',
'60k<income<80k',
'80k<income<100k',
'income>100k']]
.mean()
.T
.pct_change()
)
# change <= 0
change[change <= 0].dropna()

Empty DataFrame
Columns: [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015]
Index: []

## Beyond 1
Calculate descriptive statistics for all the changes in income brackets. Where do
you see the largest difference between income brackets?

In [27]:
change = df.groupby('Year')[['income<20k',
                      '20k<income<40k',
                      '40k<income<60k',
                      '60k<income<80k',
                      '80k<income<100k',
                      'income>100k']].mean().T.pct_change() 

# largest is for the wealthiest students, whose average scores are 
# far higher than any other income bracket.
change
# change.T.describe()

Year,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
income<20k,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20k<income<40k,0.142793,0.090894,0.080635,0.093977,0.094936,0.046611,0.074783,0.072548,0.044260,0.083207,0.098579
40k<income<60k,0.069618,0.041450,0.049796,0.045546,0.043872,0.045517,0.037439,0.041451,0.043346,0.034768,0.045059
60k<income<80k,0.025645,0.021259,0.026368,0.003136,0.005374,0.023439,0.029694,0.025994,0.017489,0.023743,0.026038
80k<income<100k,0.023999,0.029085,0.023462,0.015391,0.020566,0.025068,0.024947,0.023828,0.032817,0.030279,0.028277
income>100k,0.042319,0.040071,0.035682,0.012418,0.036175,0.039529,0.039487,0.035331,0.035250,0.022650,0.039474

## Beyond 2

Which five states have the greatest gap in SAT math scores between the richest
and poorest students?

In [28]:
df.columns

Index(['Year', 'State.Code', 'Total.Math', '20k<income<40k', '40k<income<60k',
       '60k<income<80k', '80k<income<100k', 'income<20k', 'income>100k'],
      dtype='object')

In [43]:
# df[['State.Code', 'income<20k', 'income>100k']]
df['score_diff'] = df['income>100k'] - df['income<20k']

In [44]:
(
df[['State.Code', 'income<20k', 'income>100k', 'score_diff']]
    .groupby('State.Code').mean()
    .sort_values(by='score_diff', ascending=False)
    .head()
)

            income<20k  income>100k  score_diff
State.Code
ND          237.454545   579.363636  341.909091
WY          313.818182   560.272727  246.454545
DC          375.000000   583.818182  208.818182
SD          417.818182   574.818182  157.000000
MS          444.636364   584.636364  140.000000

In [45]:
(
df[['State.Code', 'score_diff']]
    .groupby('State.Code').mean()
    .sort_values(by='score_diff', ascending=False)
    .head()
)

            score_diff
State.Code
ND          341.909091
WY          246.454545
DC          208.818182
SD          157.000000
MS          140.000000

## Beyond 3
You analyzed math scores. If you perform the same analysis on verbal SAT
scores, will you similarly see that wealthier students generally do better than
poorer students? Do any income brackets do worse than the next-poorer
bracket?

See notebook named Ex33_beyond3.ipynb